# Librairies

In [233]:
import numpy as np 
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import LabelEncoder, LabelBinarizer , OneHotEncoder , OrdinalEncoder
from sklearn import set_config
set_config(transform_output="pandas")

## EXERCICES :

### Transformer tous les dataset suivant en format numerique

### **Function**

In [ ]:
##creation d'une function pour explorer les valeurs unique des columns au format txt (dtype='object' or category); Explore_col
def Explore_col(data):
    for column in data.columns:
        dtype = data[column].dtype  # Récupère le type de la colonne
        if pd.api.types.is_object_dtype(dtype) or isinstance(dtype, pd.CategoricalDtype):  
            liste_column = data[column].unique().tolist()  
            print(f"Les valeurs prises par '{column}' sont : {liste_column}")


##cette fonction identifie et retourne la liste des colonnes d'un DataFrame pandas qui sont :
# de type texte (dtype='object')
# de type catégoriel (dtype='category')
def liste_vd(data):
    liste_vd = []  # Initialisation AVANT la boucle
    for column in data.columns:
        dtype = data[column].dtype  
        if pd.api.types.is_object_dtype(dtype) or isinstance(dtype, pd.CategoricalDtype):  
            liste_vd.append(column)  # Ajouter le nom de la colonne correcte
        
    return liste_vd  # Retourne la liste après la boucle
            
def affichage_hb(data,col):
      
    fig,ax= plt.subplots(2,1,sharex=True)
    sns.boxplot(data=data,x=col,ax=ax[1])
    sns.histplot(data=data,x=col,ax=ax[0])
    plt.suptitle("visualisation de la variable {}".format(col))
    plt.show()

###  ***Exercice 1 df= tips***

In [235]:
df= sns.load_dataset("tips")

## Target: tip
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [236]:
# le dorp permet deliminer les doublons (si c'est pas une femme c'est quelque chose d'autre
# en l'occurence un homme et peut importe ce que le modele croire, le plus important c'est que c'est quelque chose d'autre)

encoder= OneHotEncoder(sparse_output=False,drop="first") 

result_OneHotEncoding=encoder.fit_transform(df[['sex', 'smoker', 'day', 'time']])
result_OneHotEncoding.head()

   sex_Male  smoker_Yes  day_Sat  day_Sun  day_Thur  time_Lunch
0       0.0         0.0      0.0      1.0       0.0         0.0
1       1.0         0.0      0.0      1.0       0.0         0.0
2       1.0         0.0      0.0      1.0       0.0         0.0
3       1.0         0.0      0.0      1.0       0.0         0.0
4       0.0         0.0      0.0      1.0       0.0         0.0

---
---

###  ***Exercice 2 df= penguins***

In [237]:
df= sns.load_dataset("penguins")
## Target: species
df.head()

  species     island  bill_length_mm  ...  flipper_length_mm  body_mass_g     sex
0  Adelie  Torgersen            39.1  ...              181.0       3750.0    Male
1  Adelie  Torgersen            39.5  ...              186.0       3800.0  Female
2  Adelie  Torgersen            40.3  ...              195.0       3250.0  Female
3  Adelie  Torgersen             NaN  ...                NaN          NaN     NaN
4  Adelie  Torgersen            36.7  ...              193.0       3450.0  Female

[5 rows x 7 columns]

In [238]:
df.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [239]:
df_c=df.copy()
df_c.dropna(inplace=True)
df_c.head()

  species     island  bill_length_mm  ...  flipper_length_mm  body_mass_g     sex
0  Adelie  Torgersen            39.1  ...              181.0       3750.0    Male
1  Adelie  Torgersen            39.5  ...              186.0       3800.0  Female
2  Adelie  Torgersen            40.3  ...              195.0       3250.0  Female
4  Adelie  Torgersen            36.7  ...              193.0       3450.0  Female
5  Adelie  Torgersen            39.3  ...              190.0       3650.0    Male

[5 rows x 7 columns]

In [240]:

Explore_col(data=df_c)

Les valeurs prises par 'species' sont : ['Adelie', 'Chinstrap', 'Gentoo']
Les valeurs prises par 'island' sont : ['Torgersen', 'Biscoe', 'Dream']
Les valeurs prises par 'sex' sont : ['Male', 'Female']

In [241]:
# le drop permet deliminer les doublons (si c'est pas une femme c'est quelque chose d'autre
# en l'occurence un homme et peut importe ce que le modele croire, le plus important c'est que c'est quelque chose d'autre)

encoder= OneHotEncoder(sparse_output=False,drop="first") 

result_OneHotEncoding=encoder.fit_transform(df_c[['island','sex']])
result_OneHotEncoding

     island_Dream  island_Torgersen  sex_Male
0             0.0               1.0       1.0
1             0.0               1.0       0.0
2             0.0               1.0       0.0
4             0.0               1.0       0.0
5             0.0               1.0       1.0
..            ...               ...       ...
338           0.0               0.0       0.0
340           0.0               0.0       0.0
341           0.0               0.0       1.0
342           0.0               0.0       0.0
343           0.0               0.0       1.0

[333 rows x 3 columns]

In [242]:
#Résultat avec LabelBinarizer
LabelBinarizer().fit_transform(df[["species"]])[:10]

array([[1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0],
       [1, 0, 0]])

In [243]:
#Résultat avec LabelEncoder
LabelEncoder().fit_transform(df[["species"]])

c:\Users\franc\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

---
---

###  ***Exercice 3 : df= flights***

In [244]:
df= sns.load_dataset("flights")

## Target: passengers
df.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [245]:
Explore_col(data=df)

Les valeurs prises par 'month' sont : ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

In [246]:
df["month"].dtypes

CategoricalDtype(categories=['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
                  'Sep', 'Oct', 'Nov', 'Dec'],
, ordered=False, categories_dtype=object)

In [247]:
# le dorp permet deliminer les doublons (si c'est pas une femme c'est quelque chose d'autre
# en l'occurence un homme et peut importe ce que le modele croire, le plus important c'est que c'est quelque chose d'autre)
month_order=df["month"].unique().sort_values()
encoder= OrdinalEncoder(
    categories=[month_order],
    handle_unknown='use_encoded_value',
    unknown_value=-1,
    ) 

result_OrdinalEncoder=encoder.fit_transform(df[["month"]])
result_OrdinalEncoder.head()

   month
0    0.0
1    1.0
2    2.0
3    3.0
4    4.0

---
---

###  ***Exercice 4 : df= exercice***

In [248]:
df= sns.load_dataset("exercise")

## Target: pulse
df.head()

   Unnamed: 0  id     diet  pulse    time  kind
0           0   1  low fat     85   1 min  rest
1           1   1  low fat     85  15 min  rest
2           2   1  low fat     88  30 min  rest
3           3   2  low fat     90   1 min  rest
4           4   2  low fat     92  15 min  rest

In [249]:
Explore_col(data=data)

Les valeurs prises par 'diet' sont : ['low fat', 'no fat']
Les valeurs prises par 'time' sont : ['1 min', '15 min', '30 min']
Les valeurs prises par 'kind' sont : ['rest', 'walking', 'running']

In [250]:
liste_vd(data=df)

['diet', 'time', 'kind']

## **ENCODAGE**

In [251]:
# le dorp permet deliminer les doublons (si c'est pas une femme c'est quelque chose d'autre
# en l'occurence un homme et peut importe ce que le modele croire, le plus important c'est que c'est quelque chose d'autre)

#mise en place de l'ordre
diet_order= ['no fat','low fat']
time_order=['1 min', '15 min', '30 min']
kind_order=['rest', 'walking', 'running']
categories= [diet_order,time_order,kind_order]


encoder= OrdinalEncoder(
    categories=categories,
    handle_unknown='use_encoded_value',
    unknown_value=-1,
    ) 

result_OrdinalEncoder=encoder.fit_transform(df[['diet', 'time', 'kind']])
result_OrdinalEncoder.head()

   diet  time  kind
0   1.0   0.0   0.0
1   1.0   1.0   0.0
2   1.0   2.0   0.0
3   1.0   0.0   0.0
4   1.0   1.0   0.0

pour la variable 'time' il est preferable de passer les str n int histoire de garder les memes distance qui pourraoent se cacher derriere nos data

In [252]:
df["time"].replace({'1 min' : 1, '15 min' : 15, '30 min' : 30})

C:\Users\franc\AppData\Local\Temp\ipykernel_22900\2087297967.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["time"].replace({'1 min' : 1, '15 min' : 15, '30 min' : 30})
C:\Users\franc\AppData\Local\Temp\ipykernel_22900\2087297967.py:1: FutureWarning: The behavior of Series.replace (and DataFrame.replace) with CategoricalDtype is deprecated. In a future version, replace will only be used for cases that preserve the categories. To change the categories, use ser.cat.rename_categories instead.
  df["time"].replace({'1 min' : 1, '15 min' : 15, '30 min' : 30})

0      1
1     15
2     30
3      1
4     15
      ..
85    15
86    30
87     1
88    15
89    30
Name: time, Length: 90, dtype: category
Categories (3, int64): [1, 15, 30]

---
-----

###  ***Exercice 5 : df= taxis***

In [253]:
df= sns.load_dataset("taxis")

## Target: total
df.head()

               pickup             dropoff  ...  pickup_borough  dropoff_borough
0 2019-03-23 20:21:09 2019-03-23 20:27:24  ...       Manhattan        Manhattan
1 2019-03-04 16:11:55 2019-03-04 16:19:00  ...       Manhattan        Manhattan
2 2019-03-27 17:53:01 2019-03-27 18:00:25  ...       Manhattan        Manhattan
3 2019-03-10 01:23:59 2019-03-10 01:49:51  ...       Manhattan        Manhattan
4 2019-03-30 13:27:42 2019-03-30 13:37:14  ...       Manhattan        Manhattan

[5 rows x 14 columns]

In [255]:
df.nunique()

pickup             6414
dropoff            6425
passengers            7
distance           1079
fare                220
tip                 489
tolls                16
total               898
color                 2
payment               2
pickup_zone         194
dropoff_zone        203
pickup_borough        4
dropoff_borough       5
dtype: int64

In [256]:
Explore_col(df)

Les valeurs prises par 'color' sont : ['yellow', 'green']
Les valeurs prises par 'payment' sont : ['credit card', 'cash', nan]
Les valeurs prises par 'pickup_zone' sont : ['Lenox Hill West', 'Upper West Side South', 'Alphabet City', 'Hudson Sq', 'Midtown East', 'Times Sq/Theatre District', 'Battery Park City', 'Murray Hill', 'East Harlem South', 'Lincoln Square East', 'LaGuardia Airport', 'Lincoln Square West', 'Financial District North', 'Upper West Side North', 'East Chelsea', 'Midtown Center', 'Gramercy', 'Penn Station/Madison Sq West', 'Sutton Place/Turtle Bay North', 'West Chelsea/Hudson Yards', 'Clinton East', 'Clinton West', 'UN/Turtle Bay South', 'Midtown South', 'Midtown North', 'Garment District', 'Lenox Hill East', 'Flatiron', 'TriBeCa/Civic Center', nan, 'Upper East Side North', 'West Village', 'Greenwich Village South', 'JFK Airport', 'East Village', 'Union Sq', 'Yorkville West', 'Central Park', 'Meatpacking/West Village West', 'Kips Bay', 'Morningside Heights', 'Astoria', 'East Tremont', 'Upper East Side South', 'Financial District South', 'Bloomingdale', 'Queensboro Hill', 'SoHo', 'Brooklyn Heights', 'Yorkville East', 'Manhattan Valley', 'DUMBO/Vinegar Hill', 'Little Italy/NoLiTa', 'Mott Haven/Port Morris', 'Greenwich Village North', 'Stuyvesant Heights', 'Lower East Side', 'East Harlem North', 'Chinatown', 'Fort Greene', 'Steinway', 'Central Harlem', 'Crown Heights North', 'Seaport', 'Two Bridges/Seward Park', 'Boerum Hill', 'Williamsburg (South Side)', 'Rosedale', 'Flushing', 'Old Astoria', 'Soundview/Castle Hill', 'Stuy Town/Peter Cooper Village', 'World Trade Center', 'Sunnyside', 'Washington Heights South', 'Prospect Heights', 'East New York', 'Hamilton Heights', 'Cobble Hill', 'Long Island City/Queens Plaza', 'Central Harlem North', 'Manhattanville', 'East Flatbush/Farragut', 'Elmhurst', 'East Concourse/Concourse Village', 'Park Slope', 'Greenpoint', 'Williamsburg (North Side)', 'Long Island City/Hunters Point', 'South Ozone Park', 'Ridgewood', 'Downtown Brooklyn/MetroTech', 'Queensbridge/Ravenswood', 'Williamsbridge/Olinville', 'Bedford', 'Gowanus', 'Jackson Heights', 'South Jamaica', 'Bushwick North', 'West Concourse', 'Queens Village', 'Windsor Terrace', 'Flatlands', 'Van Cortlandt Village', 'Woodside', 'East Williamsburg', 'Fordham South', 'East Elmhurst', 'Kew Gardens', 'Flushing Meadows-Corona Park', 'Marine Park/Mill Basin', 'Carroll Gardens', 'Canarsie', 'East Flatbush/Remsen Village', 'Jamaica', 'Marble Hill', 'Bushwick South', 'Erasmus', 'Claremont/Bathgate', 'Pelham Bay', 'Soundview/Bruckner', 'South Williamsburg', 'Battery Park', 'Forest Hills', 'Maspeth', 'Bronx Park', 'Starrett City', 'Brighton Beach', 'Brownsville', 'Highbridge Park', 'Bensonhurst East', 'Mount Hope', 'Prospect-Lefferts Gardens', 'Bayside', 'Douglaston', 'Midwood', 'North Corona', 'Homecrest', 'Westchester Village/Unionport', 'University Heights/Morris Heights', 'Inwood', 'Washington Heights North', 'Flatbush/Ditmas Park', 'Rego Park', 'Riverdale/North Riverdale/Fieldston', 'Jamaica Estates', 'Borough Park', 'Sunset Park West', 'Belmont', 'Auburndale', 'Schuylerville/Edgewater Park', 'Co-Op City', 'Crown Heights South', 'Spuyten Duyvil/Kingsbridge', 'Morrisania/Melrose', 'Hollis', 'Parkchester', 'Coney Island', 'East Flushing', 'Richmond Hill', 'Bedford Park', 'Highbridge', 'Clinton Hill', 'Sheepshead Bay', 'Madison', 'Dyker Heights', 'Cambria Heights', 'Pelham Parkway', 'Hunts Point', 'Melrose South', 'Springfield Gardens North', 'Bay Ridge', 'Elmhurst/Maspeth', 'Crotona Park East', 'Bronxdale', 'Briarwood/Jamaica Hills', 'Van Nest/Morris Park', 'Murray Hill-Queens', 'Kingsbridge Heights', 'Whitestone', 'Saint Albans', 'Allerton/Pelham Gardens', 'Howard Beach', 'Norwood', 'Bensonhurst West', 'Columbia Street', 'Middle Village', 'Prospect Park', 'Ozone Park', 'Gravesend', 'Glendale', 'Kew Gardens Hills', 'Woodlawn/Wakefield', 'West Farms/Bronx River', 'Hillcrest/Pomonok']
Les valeurs prises par 'dropoff_zone' sont : ['UN/Turtle Bay South', 'Upper West Side South', 'West Village', 'Yorkville West', 'Midtown East', 'Two Bridges/Seward Park', 'Flatiron', 'Midtown Center', 'Central Park', 'Astoria', 'Manhattan Valley', 'Times Sq/Theatre District', 'Clinton East', 'Meatpacking/West Village West', 'East Harlem South', 'East Chelsea', 'Kips Bay', 'Murray Hill', 'Sutton Place/Turtle Bay North', 'Midtown North', 'Gramercy', 'Midtown South', 'Seaport', 'Lenox Hill West', 'East Harlem North', 'Garment District', 'West Chelsea/Hudson Yards', 'Clinton West', 'Lenox Hill East', 'Carroll Gardens', nan, 'Washington Heights South', 'Battery Park City', 'Penn Station/Madison Sq West', 'Union Sq', 'Sunnyside', 'Lincoln Square West', 'Upper East Side North', 'Financial District North', 'Lower East Side', 'Yorkville East', 'Upper West Side North', 'Jackson Heights', 'Upper East Side South', 'Chinatown', 'Stuy Town/Peter Cooper Village', 'Morningside Heights', 'Lincoln Square East', 'Little Italy/NoLiTa', 'Downtown Brooklyn/MetroTech', 'DUMBO/Vinegar Hill', 'Greenwich Village South', 'LaGuardia Airport', 'East Village', 'JFK Airport', 'Marble Hill', 'Greenwich Village North', 'Williamsburg (North Side)', 'Brooklyn Heights', 'Riverdale/North Riverdale/Fieldston', 'Steinway', 'Sheepshead Bay', 'Crown Heights North', 'TriBeCa/Civic Center', 'Midwood', 'Alphabet City', 'Boerum Hill', 'Financial District South', 'Cypress Hills', 'Park Slope', 'Central Harlem', 'North Corona', 'Greenpoint', 'Long Island City/Hunters Point', 'Hillcrest/Pomonok', 'Bloomingdale', 'Baisley Park', 'Crown Heights South', 'Soundview/Castle Hill', 'World Trade Center', 'Randalls Island', 'Melrose South', 'Columbia Street', 'Williamsburg (South Side)', 'SoHo', 'Hudson Sq', 'Fort Greene', 'Cobble Hill', 'Clinton Hill', 'Central Harlem North', 'East Flushing', 'Old Astoria', 'Forest Hills', 'Briarwood/Jamaica Hills', 'East New York', 'Ridgewood', 'Elmhurst', 'East Williamsburg', 'Williamsbridge/Olinville', 'University Heights/Morris Heights', 'Bushwick South', 'Flushing Meadows-Corona Park', 'Long Island City/Queens Plaza', 'Manhattanville', 'Elmhurst/Maspeth', 'Inwood', 'Woodhaven', 'Hamilton Heights', 'Middle Village', 'Prospect Heights', 'Richmond Hill', 'Mount Hope', 'Bushwick North', 'Canarsie', 'Gowanus', 'Washington Heights North', 'Westchester Village/Unionport', 'Queens Village', 'Woodside', 'Bedford', 'Highbridge', 'Stuyvesant Heights', 'Queensbridge/Ravenswood', 'East Flatbush/Farragut', 'Mott Haven/Port Morris', 'Prospect-Lefferts Gardens', 'Sunset Park West', 'South Jamaica', 'Howard Beach', 'South Williamsburg', 'Woodlawn/Wakefield', 'Rego Park', 'West Concourse', 'Manhattan Beach', 'Battery Park', 'Bronxdale', 'West Brighton', 'Flatlands', 'Glendale', 'East Concourse/Concourse Village', 'Ozone Park', 'South Ozone Park', 'Norwood', 'Parkchester', 'East Tremont', 'Douglaston', 'Windsor Terrace', 'Bensonhurst West', 'Kew Gardens', 'Flatbush/Ditmas Park', 'Starrett City', 'Roosevelt Island', 'Bay Ridge', 'Saint Albans', 'Pelham Parkway', 'Prospect Park', 'Jamaica', 'Murray Hill-Queens', 'Stapleton', 'Maspeth', 'Dyker Heights', 'Allerton/Pelham Gardens', 'Co-Op City', 'Belmont', 'Bensonhurst East', 'Kew Gardens Hills', 'Crotona Park East', 'Van Cortlandt Village', 'Springfield Gardens South', 'Corona', 'Brownsville', 'Red Hook', 'Bayside', 'Van Nest/Morris Park', 'Gravesend', 'Oakland Gardens', 'Claremont/Bathgate', 'Ocean Hill', 'Brighton Beach', 'Spuyten Duyvil/Kingsbridge', 'Kingsbridge Heights', 'Soundview/Bruckner', 'Fresh Meadows', 'East Elmhurst', 'Hunts Point', 'Cambria Heights', 'Whitestone', 'East Flatbush/Remsen Village', 'Rosedale', 'Inwood Hill Park', 'Bedford Park', 'Jamaica Estates', 'Borough Park', 'Flushing', 'Auburndale', 'Bath Beach', 'Queensboro Hill', 'Morrisania/Melrose', 'Madison', 'Homecrest', 'Eastchester', 'College Point', 'Brooklyn Navy Yard', 'Marine Park/Mill Basin']
Les valeurs prises par 'pickup_borough' sont : ['Manhattan', 'Queens', nan, 'Bronx', 'Brooklyn']
Les valeurs prises par 'dropoff_borough' sont : ['Manhattan', 'Queens', 'Brooklyn', nan, 'Bronx', 'Staten Island']

In [257]:
liste_vd(df)

['color',
 'payment',
 'pickup_zone',
 'dropoff_zone',
 'pickup_borough',
 'dropoff_borough']